#### Terraform Format and Style 🖌``
#### Terraform Initialization ⚙️``
#### Terraform Plan 📖`success`
#### Terraform Validation 🤖`success`

<details><summary>Show Plan</summary>

```

terraform
module.shared.data.terraform_remote_state.infrastructure_state: Reading...
module.shared.data.terraform_remote_state.infrastructure_state: Read complete after 1s

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
+/- create replacement and then destroy

Terraform will perform the following actions:

  # module.buckets.aws_s3_bucket_object.add_investment_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_investment_function_object" {
      ~ etag               = "07f834cb6227fe085b553930003bb5de" -> "1e17a33537d01738ade2a18b1a599892"
        id                 = "lambdas/demo/add_investment_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_scenario_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_scenario_function_object" {
      ~ etag               = "aa75907c18e421b4ceccba3de1d6c7ae" -> "a1aa2802cf9ecaa0dd43056e78064cdb"
        id                 = "lambdas/demo/add_scenario_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_tag_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_tag_function_object" {
      ~ etag               = "bdc7713041da0068c12978d436d66803" -> "09228175af71d8dc59fc78b66b0633ca"
        id                 = "lambdas/demo/add_tag_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.add_user_to_customer_group_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "add_user_to_customer_group_function_object" {
      ~ etag               = "453e4384c736fa1797d4438e122bbf71" -> "aa42e7d6db844a2ed764dd3eff420112"
        id                 = "lambdas/demo/add_user_to_customer_group_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.assign_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "assign_company_permissions_function_object" {
      ~ etag               = "2d7bcd3117c5a158f2a8b5b902d7a7ff" -> "a8b02c93d1f2395d73d0ff845b82dd05"
        id                 = "lambdas/demo/assign_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.authorize_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "authorize_function_object" {
      ~ etag               = "a9b24088629c5aa5a588e451965ed616" -> "4bcea49d93079424a25eb267cb7a541e"
        id                 = "lambdas/demo/authorize_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_company_publicly_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_company_publicly_function_object" {
      ~ etag               = "e959a9c9461fcefec688df50db184ae9" -> "1307ac88265b6845b84e6c589b8c3d23"
        id                 = "lambdas/demo/change_company_publicly_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.change_user_role_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "change_user_role_function_object" {
      ~ etag               = "bbc72e87c03b5d8fa5c1f7b98f81d8c6" -> "aaeba28082dfd4a40b9b7b83fe19d6cf"
        id                 = "lambdas/demo/change_user_role_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.connect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "connect_function_object" {
      ~ etag               = "a19cd238838913055f074a41b949e872" -> "c6bc2eb4f59f45c5a360c9d53cf60cb5"
        id                 = "lambdas/demo/connect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_company_function_object" {
      ~ etag               = "601ff53a29a4e23d68d01161340436ac" -> "d401c2ad85b971aea64567d51bb655a8"
        id                 = "lambdas/demo/delete_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_scenarios_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_scenarios_function_object" {
      ~ etag               = "8d259c495fe20b773fd78167aae6cb8d" -> "69dbb2a5815f5954b3ec0659d255acdf"
        id                 = "lambdas/demo/delete_scenarios_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.delete_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "delete_tags_function_object" {
      ~ etag               = "7c7a5708cd1f541f77db2e6e2fc527cb" -> "deade0f04d40c1738dcbb9672bd567bc"
        id                 = "lambdas/demo/delete_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.disconnect_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "disconnect_function_object" {
      ~ etag               = "d1a17e0fab4c38041a8f468d97251217" -> "80107740b5d1a4db1362582dd416a44f"
        id                 = "lambdas/demo/disconnect.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.download_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "download_comparison_vs_peers_function_object" {
      ~ etag               = "09f0d2410641ad2d3fbf33ef3417c8b3" -> "134c2cfaf3e5b09f7ce11001cc4328f1"
        id                 = "lambdas/demo/download_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "edit_modify_data_function_object" {
      ~ etag               = "f3f6c5665297d31021033353f1f955bb" -> "925e1569e1ceca054cf84cd73c746834"
        id                 = "lambdas/demo/edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_companies_function_object" {
      ~ etag               = "e9652ab12003c7f37ce5b9ce079bfb7b" -> "25c79078d7937d6ae6bac86b1a3087e6"
        id                 = "lambdas/demo/get_all_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_public_companies_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_public_companies_function_object" {
      ~ etag               = "e61137c0a52c4c8bf97273e6b68618dd" -> "4d13889965645f9ea27b444b1126fa68"
        id                 = "lambdas/demo/get_all_public_companies_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_ranges_function_object" {
      ~ etag               = "bfe60566e68821c87ec1124c3b60ac15" -> "65d295562798f0b38c31c9aa6760f456"
        id                 = "lambdas/demo/get_all_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_all_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_all_tags_function_object" {
      ~ etag               = "83d7e39948a32745c3e00acfa81f0775" -> "af6782cc97630ae4547ec38fecb2bb68"
        id                 = "lambdas/demo/get_all_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_by_metric_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_by_metric_report_function_object" {
      ~ etag               = "e4131bd38321bcc8dae9b4b2d9ae606e" -> "456d3cb343eb53767f8a73ab487bb893"
        id                 = "lambdas/demo/get_by_metric_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_details_function_object" {
      ~ etag               = "c1c2b6d8fb2fe63a419fb344fb14543d" -> "0a28b7e4710f89ce6e31bbf991409f74"
        id                 = "lambdas/demo/get_company_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_investments_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_investments_function_object" {
      ~ etag               = "9e7953263f48b90be8c58ee4a39c66f8" -> "95c59b1549fa5bcf75d39a2003fea252"
        id                 = "lambdas/demo/get_company_investments_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_permissions_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_permissions_function_object" {
      ~ etag               = "2f8c370c7f6c89ad51dbbc9bede93fdc" -> "7c0976f488fdfa2f28d789af47f11f78"
        id                 = "lambdas/demo/get_company_permissions_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_company_report_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_company_report_vs_peers_function_object" {
      ~ etag               = "7d9f0191effde14274151ee9a62a55b7" -> "eed0b65ef86c4a4b933cf7c3d4e6390d"
        id                 = "lambdas/demo/get_company_report_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_comparison_vs_peers_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_comparison_vs_peers_function_object" {
      ~ etag               = "8c7e59b21f5137167371e416dd60d597" -> "d673b6dbc82bae5a093925a347221d0b"
        id                 = "lambdas/demo/get_comparison_vs_peers_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_dynamic_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_dynamic_report_function_object" {
      ~ etag               = "cd0034257356293578248885a6547dcf" -> "88080fa3c67f9a0003316496c04dc38d"
        id                 = "lambdas/demo/get_dynamic_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_edit_modify_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_edit_modify_data_function_object" {
      ~ etag               = "8d5bd82bb8566de2dda53e4b84b423dd" -> "122b27403d9f2d61f4702227603170c4"
        id                 = "lambdas/demo/get_edit_modify_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_full_year_total_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_full_year_total_function_object" {
      ~ etag               = "15bf5b42b757fbfdd79dd7e3a6aa1f20" -> "0d5255e42afa087a3863ca265343be85"
        id                 = "lambdas/demo/get_full_year_total_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_investment_date_report_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_investment_date_report_function_object" {
      ~ etag               = "99b177d1995b2054bb58617041baed0f" -> "b8c68f41ef1e41d54f75b55dc5da7f18"
        id                 = "lambdas/demo/get_investment_date_report_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_metric_types_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_metric_types_function_object" {
      ~ etag               = "02db5f86ea9e7a678eeebe5985c1b259" -> "b96e78d32e5da101b54181e982ef50be"
        id                 = "lambdas/demo/get_metric_types_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_ranges_by_metric_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_ranges_by_metric_function_object" {
      ~ etag               = "b7093c5e3a021ef9e61f7a0db6d2fcae" -> "d382c44697f1f0a22258b4c48767988c"
        id                 = "lambdas/demo/get_ranges_by_metric_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_roles_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_roles_function_object" {
      ~ etag               = "c151674dbcbc1a085261b37fe21088ab" -> "f3c0f09d93f08b839de3e2ab8e71cbb4"
        id                 = "lambdas/demo/get_roles_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_tags_by_company_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_tags_by_company_function_object" {
      ~ etag               = "f07b32129180eeef032d2b636c69946d" -> "7eab5f45a6d6826c6c5bb5718efa949a"
        id                 = "lambdas/demo/get_tags_by_company_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_universe_overview_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_universe_overview_function_object" {
      ~ etag               = "6ddef67d1582f24ac0d020bc9e72449f" -> "bda7e7c7a809567c9d8051b690dc3300"
        id                 = "lambdas/demo/get_universe_overview_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_user_details_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_user_details_function_object" {
      ~ etag               = "cfad19a9cf91b2abfc82eeb317eee8b6" -> "3e6a64f3e588c2886b8c4ccd1f4ed7d3"
        id                 = "lambdas/demo/get_user_details_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.get_users_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "get_users_function_object" {
      ~ etag               = "adcfc5e29eb180df64d8210b6fcfdbc6" -> "93a16218b8d8756d2e822cce16409312"
        id                 = "lambdas/demo/get_users_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.glue_trigger_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "glue_trigger_function_object" {
      ~ etag               = "22ee05ebfc08eaee8eeb2175b39642c7" -> "220b57ca4ea9c644a4d16bd1bb8d6205"
        id                 = "lambdas/demo/glue_trigger_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.layer_libraries_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "layer_libraries_object" {
      ~ etag               = "bb85a9370091b0bbfb6175ff268d645e" -> "13e83fbc265624bf12eb3ae4940b32a8"
        id                 = "layer/demo/layer_libraries.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.message_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "message_function_object" {
      ~ etag               = "5b02798322bddf80bb154e29612e1c7f" -> "d43ef9089849cdda56a81838584730f8"
        id                 = "lambdas/demo/message.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.modify_ranges_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "modify_ranges_function_object" {
      ~ etag               = "ef43aac585b580c5ee4e070f21af1075" -> "a4e59d2bd2f2a2be77952f47bf7cedbf"
        id                 = "lambdas/demo/modify_ranges_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.register_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "register_function_object" {
      ~ etag               = "d651b0c4cc267bef137b713a943f1d8e" -> "faaf1868fe9c11c189a700dd9a094c19"
        id                 = "lambdas/demo/register.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_data_function_object" {
      ~ etag               = "65a1007208faa96bf93d944edf2bfd8c" -> "279138e9583e6c7005676211d62fb77b"
        id                 = "lambdas/demo/update_data.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.update_tags_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "update_tags_function_object" {
      ~ etag               = "71e532075095176ed11332ee8e48a5d1" -> "13498d19ef9b8c150e98a7f049498d15"
        id                 = "lambdas/demo/update_tags_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.upload_file_s3_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "upload_file_s3_function_object" {
      ~ etag               = "8237ed4cbdcea80791bc7a8e089695d2" -> "67b74754d3c08708debe9377555a0a53"
        id                 = "lambdas/demo/upload_file_s3_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.validate_data_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "validate_data_function_object" {
      ~ etag               = "c5d79fb3a93aa39fa3e47425eb0b5eeb" -> "257c45dd1de30d84291ca96f1dc614b4"
        id                 = "lambdas/demo/validate_data_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.buckets.aws_s3_bucket_object.verify_users_with_same_email_function_object will be updated in-place
  ~ resource "aws_s3_bucket_object" "verify_users_with_same_email_function_object" {
      ~ etag               = "3f7df2c9ee5178e4fec54698e058e708" -> "5b3ae24c41c80503cee6189a10ccc5e0"
        id                 = "lambdas/demo/verify_users_with_same_email_handler.zip"
        tags               = {}
      + version_id         = (known after apply)
        # (10 unchanged attributes hidden)
    }

  # module.functions.aws_lambda_function.add_investment_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_investment_lambda_function" {
        id                             = "demo_add_investment_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:26.000+0000" -> (known after apply)
      ~ source_code_hash               = "MS755qiXjgLVP+X+yFaB6a6xhoLmcUDtI/UksKzmeSg=" -> "/yhBwOmh0n3iC0xQ9xJdXaZyPLRTT5E9vVobK5JN78g="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_scenario_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_scenario_lambda_function" {
        id                             = "demo_add_scenario_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "t5PB/tKfdAJPBOiaHJm2VIYXg2IzGFdfRukyTVsFcSw=" -> "egPe6JobWj1HrQjTMmLxGI2hnGXNDoK7MUeLB32qD5Q="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_tag_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_tag_lambda_function" {
        id                             = "demo_add_tag_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:22.000+0000" -> (known after apply)
      ~ source_code_hash               = "EP1oOpdzjoaLVYylnauLPCuOVrInJRIg8S74ctePKwA=" -> "4VqcjrQyaZ5SdwxVLaDHkj0+hCGDa267vcQVKUtHxbM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.add_user_to_customer_group_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "add_user_to_customer_group_lambda_function" {
        id                             = "demo_add_user_to_customer_group_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:32.000+0000" -> (known after apply)
      ~ source_code_hash               = "kVgtuNDjZB00+7LZihhItd15GCOq3HDhtt42Owngscw=" -> "SGks11fsnT2jnPJbtUc2zYzA+Fok2GV1kbglo0P10Sc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.assign_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "assign_company_permissions_lambda_function" {
        id                             = "demo_assign_company_permissions_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "4+jMLJEK5h+0ZUdCWirqhVXZzNvdObpXQHZgn69gejM=" -> "qx7L/ZGorv6Dj4Ztqt9H/T9WpXo4TnipBnz7NjCT3K0="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.authorize_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "authorize_lambda_function" {
        id                             = "demo_authorize_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "q37c5Wmgq84RePz6v9QkhEVuNOg4NndYVQLOTQsPD1o=" -> "0/FoxP6jLvTJ5Ty+HgbgXQ3OCjqvoVqGUPs/Sbd3dR4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_company_publicly_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_company_publicly_lambda_function" {
        id                             = "demo_change_company_publicly_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "uufMUu2rMzYQGZrYWf/GcZ7G2CXnPDSybSVnIUzWLEg=" -> "eaeyyfwirfoZI4O9YGvB+Yr3q/iQGof9/cbeivqqnTg="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.change_user_role_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "change_user_role_lambda_function" {
        id                             = "demo_change_user_role_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "BzTlkL5pvC4B8zXVE32MGz2VD2SdznqZjhhcoKnInNo=" -> "Pjt2KhY6QiyEs1PcIRxS7Y08dEoIeX4CBSN6H77J1f4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.connect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "connect_lambda_function" {
        id                             = "demo_connect_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:12.000+0000" -> (known after apply)
      ~ source_code_hash               = "IgpBSWXxx2bgVRmUWMd8VPvq9AACWnxQQGBBxvYl+iY=" -> "Psjwd3SE/APQ3WqNt6wTX58l1BW0HlBXXga4yPiPM2w="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.functions.aws_lambda_function.delete_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_company_lambda_function" {
        id                             = "demo_delete_company_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:12.000+0000" -> (known after apply)
      ~ source_code_hash               = "JsMhorwkj2ryJ3WvNhmO1Xwc4n2onciSdNKmVED8cxg=" -> "KkF0RnHZeH8eZir4r/tFjBC2aqoq55Jp0A9GtRIlNao="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_scenarios_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_scenarios_lambda_function" {
        id                             = "demo_delete_scenarios_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "NTgs+EyV/uC7GAH+q5N6iXEjaOl7VsLmVCjie7TIZts=" -> "zqeH4OECkvUgbFxagZdbNXNmf9iwzBlXnoF6VMb89Mc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.delete_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "delete_tags_lambda_function" {
        id                             = "demo_delete_tags_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "FuEnSMwco8rGsBlmHZEKCBWYDtGopyQIdiy6j/0foQI=" -> "9YQpwzjDU0Mn5XGPoWhj8zO7BR8PDpM2DKqNx1JJX5k="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.disconnect_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "disconnect_lambda_function" {
        id                             = "demo_disconnect_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "ttHHWOjEmrp31tuMIbhutFvmN4CS11e2hegvfoMRpLM=" -> "w7cZlZD/krzqni8uo7is/hcDaybkO6bNUaW7tXUg++k="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.download_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "download_comparison_vs_peers_lambda_function" {
        id                             = "demo_download_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:24.000+0000" -> (known after apply)
      ~ source_code_hash               = "JMZLwZlG1PaQPeG4/HRaT4o1W4wGjNqL/of2+xyxgR4=" -> "k7CJHXyzmRFogYWjC+5tauFrBBNc5SSDAnF3XcbOg2Q="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "edit_modify_data_lambda_function" {
        id                             = "demo_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:07.000+0000" -> (known after apply)
      ~ source_code_hash               = "+uaM3gisk85HGF3LIIjsl0tmLxIQSdvcU0yj8/G2RBE=" -> "TEIzY6pSwT3jgAe0GzaP0i7IrZUrSzIihGRL1PM1Ae8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_companies_lambda_function" {
        id                             = "demo_get_all_companies_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "JQ4HpohmMzVKwIikH2oBswNW/c3W3d42GuSDfXgflfU=" -> "5qut7iwpttl8RXsmEVxcbtfi+iyiSPqeK2e+j/s6y30="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_public_companies_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_public_companies_lambda_function" {
        id                             = "demo_get_all_public_companies_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:35.000+0000" -> (known after apply)
      ~ source_code_hash               = "qbxcaFqfw4wkF/nOtxN6GdS3mUmI8u+5u4obaEY+0Dg=" -> "T0oKKIfH9+PKu14LX1z6k0ocQXXjsToNmnUcm/01drI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_ranges_lambda_function" {
        id                             = "demo_get_all_ranges_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:34.000+0000" -> (known after apply)
      ~ source_code_hash               = "AKGaLAeQWRKB7AFl3ksz/3unRswGmvTBwPWR3ZLaoso=" -> "/4L8aqU44lxK/5OA5srhNB2wO55zMUXEXWoym8m3UL4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_all_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_all_tags_lambda_function" {
        id                             = "demo_get_all_tags_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "PoJcnVG+YKYdI0f0gEM2+YXIqwxC1fBBJuEhze1cGu8=" -> "5CfkozT2IvHfEYGNc9gfZkPao48bb0jlQ+0gMGuppNE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_by_metric_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_by_metric_report_lambda_function" {
        id                             = "demo_get_by_metric_report_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:22.000+0000" -> (known after apply)
      ~ source_code_hash               = "ZXutaqjc+alJuTTMJ4mZ/R92/OTj7Wmq+Au9+t1dHPo=" -> "P0TLAhq4eEJ+VukpFJdpOF5wLVUunABUUVb6mI6ed7Y="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_details_lambda_function" {
        id                             = "demo_get_company_details_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:17.000+0000" -> (known after apply)
      ~ source_code_hash               = "beL+wnKZ2YNJzkhbRdt3vvDTGMQNxASZNtZGrLvaV4s=" -> "CeOxTZ9DS4oESFJR7fKT03SeY3tbT+NwF6x1EAoqXKw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_investments_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_investments_lambda_function" {
        id                             = "demo_get_company_investments_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "+Oep8s+rgAVQIUjbaAugw6vAhtAXw4aTnZlxxm6CvS8=" -> "fApasaW+K/bMGH9NS42wK96LLUKekT7/V9uEvivwv+o="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_permissions_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_permissions_lambda_function" {
        id                             = "demo_get_company_permissions_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "Ec4PTpaTCimyooPR9JGzvjNed6ADmS/aHJxS6lnA0L8=" -> "jlQUwTBQUQkKqzGTvLM7HpCq0ZRs8Ft58Yfd2hbWJDM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_company_report_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_company_report_vs_peers_lambda_function" {
        id                             = "demo_get_company_report_vs_peers_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "zKnmt3zAr5FtIkeekRvvlbd+zO4+2+UiVvFRrWOuXgw=" -> "mql2p27urA/H3V6WcZhaBdN9zbMbifBIHWr87cJIfm8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_comparison_vs_peers_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_comparison_vs_peers_lambda_function" {
        id                             = "demo_get_comparison_vs_peers_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "ascV00k7JSj/eSSURQvDhxaX2heRLYoO15Kzup+ag/E=" -> "UY9Zm1cJwxcMOLjBZ8926GGldgH7+Bo2eUAb63hGZUk="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_dynamic_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_dynamic_report_lambda_function" {
        id                             = "demo_get_dynamic_report_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "EfhGUT3tx76l9IJKs/abdDRcPA7ZoNxuYRn7DWKsOSk=" -> "24KzPcSltoTh1PaMhRG8pEjfeF6ye0zlM94Q01yJNgc="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_edit_modify_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_edit_modify_data_lambda_function" {
        id                             = "demo_get_edit_modify_data_lambda_function"
      ~ last_modified                  = "2023-01-19T23:34:29.000+0000" -> (known after apply)
      ~ source_code_hash               = "qIp7vgSENcUGGXoS7BoW7JJmLJvv5BYlYkQRLL0TCRU=" -> "rPRqtuYf6l28Y6Gjk3mLu+jj8gllFzVjb5uaT5i0PcI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_full_year_total_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_full_year_total_lambda_function" {
        id                             = "demo_get_full_year_total_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:26.000+0000" -> (known after apply)
      ~ source_code_hash               = "2TqYioqTAyZd9ByLRnYCtGPxtz3cCOiVTUz4K9QprSM=" -> "JI1wwke1gjG0aq24wKtOfjNHcnVauH9Xr9wkh6Fu4jU="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_investment_date_report_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_investment_date_report_lambda_function" {
        id                             = "demo_get_investment_date_report_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "YvDN/QIqMRvslk1rzT14LivaplYSwARGwCxpaHkZsXk=" -> "9w+4IJcq0lwTN2YEk3yKsVTu4IC2pHKTJibQBTH2CjQ="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_metric_types_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_metric_types_lambda_function" {
        id                             = "demo_get_metric_types_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "UkKU6G8Iu7SCSEeADvQGTt6DFwRFdClCJ01Hv3R9u4U=" -> "ixdEabaz2F83PhkpU0CB3B6yg7IeduaiBEir9TErw68="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_ranges_by_metric_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_ranges_by_metric_lambda_function" {
        id                             = "demo_get_ranges_by_metric_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "6OkfGbruwr2rRZNx4EDL7in1U9yLbhwO0uANc9yHgVc=" -> "SQqC5CFqdUfXBWpytyAHaKklY99NZXmww5PMjeLsQ/k="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_roles_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_roles_lambda_function" {
        id                             = "demo_get_roles_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "Hx0mDGJQ8KbYBGGXh+sQggr+ReFQbScbkSVyY2Ux8Fg=" -> "w1r5x7GhY7KV8kPet1Q7Jp5ex3dzGp3NPMkY7TCKQv8="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_tags_by_company_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_tags_by_company_lambda_function" {
        id                             = "demo_get_tags_by_company_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:25.000+0000" -> (known after apply)
      ~ source_code_hash               = "16A2pw8nlFTZMRLJmAaX+WwMPMA1m5dWz8O8pS/qp4w=" -> "I+1uCmrfqxo4A4lSljyr99/aHemHJu2WrVVRw37e6JA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_universe_overview_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_universe_overview_lambda_function" {
        id                             = "demo_get_universe_overview_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "rNDDl0R1+sp5ZMVYyJyguWE9klc0E/5Qqj1YQ5o78oM=" -> "IKPj2WcUuH374Kn/Ca/O6IXyc1ya8iqJc9gXPOr5VO4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_user_details_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_user_details_lambda_function" {
        id                             = "demo_get_user_details_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:15.000+0000" -> (known after apply)
      ~ source_code_hash               = "tpgbDZeyoeDYVdL1ThTTXBSnRmWot7tMnJEL33edENA=" -> "fTcgcICGeqB64u6vDu8fNnLERJNiiFYbhHEoEpKtVc4="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.get_users_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "get_users_lambda_function" {
        id                             = "demo_get_users_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "rkNrxroIb5+pGcT/5abm2Zz5zByodb5483DnrG62kTM=" -> "OczV/dq7mTjVw//LkAIzMbgKuahxkoTm6zLq4Vi+5UA="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.glue_trigger_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "glue_trigger_lambda_function" {
        id                             = "demo_glue_trigger_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:36.000+0000" -> (known after apply)
      ~ source_code_hash               = "k0N7bTzCsWIFRXUEHAi10mmM2OGGi3KuL48YMwHHUAY=" -> "BY/gIccQSz+XAxNLWf5HrP/hCqaESA9D7k97u+M8VF8="
        tags                           = {}
        # (18 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.message_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "message_lambda_function" {
        id                             = "demo_message_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:44.000+0000" -> (known after apply)
      ~ source_code_hash               = "lrD03TZ5x+IRsQcP/qO7UX88DflVWTCL6QyciOg1ywk=" -> "EazpcRBAGJJHgu+pKbingwIullowDfC4rU5P4PUkCWM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.modify_ranges_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "modify_ranges_lambda_function" {
        id                             = "demo_modify_ranges_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "pOtYEOP7d/6pXABh8Xkzd5nBlNk/bTD8eM+Cf2ZnJYo=" -> "ZBVJGBGdJ+j2BykatTYj674XEZFlYPnvFVdNbz8ACxM="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.register_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "register_lambda_function" {
        id                             = "demo_register_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:16.000+0000" -> (known after apply)
      ~ source_code_hash               = "LzMBXltqcyzSOSK6aaUGlcZmCwhZt0ZEKV9futc3Iy8=" -> "j+hU/jOapbm9bgc7GOmiPvvdH2IN/HPo/5Xj4ZApRtw="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_data_lambda_function" {
        id                             = "demo_update_data_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:05.000+0000" -> (known after apply)
      ~ source_code_hash               = "oBYY3VO5AIx9u3oeHyX8prTXubkDk3qzb4Xa7iF65zI=" -> "vWZsooL0Nuw/kQxum2DQqZpMYGnqxmL6cN/L6+CUG4s="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.update_tags_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "update_tags_lambda_function" {
        id                             = "demo_update_tags_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:42.000+0000" -> (known after apply)
      ~ source_code_hash               = "9rNSPL3EkWYHmivfnK6J2q6H7BTNlns3mRGIUTRyE+E=" -> "2bVAbHSbAyqYwtfvjMpsa9zur3sCdAxcskcneAKAEYI="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.upload_file_s3_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "upload_file_s3_lambda_function" {
        id                             = "demo_upload_file_s3_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:33.000+0000" -> (known after apply)
      ~ source_code_hash               = "xPTtZ/MMAyh8Wt0k4XVAvond94ke04WfNQazPOPu10I=" -> "vba5F58sqRPfWKskDwGyItEsLXdlpuv+U3oqlbkZaxE="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.validate_data_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "validate_data_lambda_function" {
        id                             = "demo_validate_data_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:06.000+0000" -> (known after apply)
      ~ source_code_hash               = "YlSya3dSMroenMmJmokC1/bsZ51e6fR/ZJbnCJvkN9A=" -> "FHL2sCuI9Xd9cNWkF84PrBfSr2PdPb+meGugXd/WNjo="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (3 unchanged blocks hidden)
    }

  # module.functions.aws_lambda_function.verify_users_with_same_email_lambda_function will be updated in-place
  ~ resource "aws_lambda_function" "verify_users_with_same_email_lambda_function" {
        id                             = "demo_verify_users_with_same_email_lambda_function"
      ~ last_modified                  = "2023-01-12T21:12:40.000+0000" -> (known after apply)
      ~ source_code_hash               = "Tcl/oaKuGRC8nEcSY+InRV+ZP2OBn6RB2wGeO7c91xg=" -> "K/J8FvN++cZGpofBhAfascuAbd6SQeRQyaSAnCaY+4I="
        tags                           = {}
        # (24 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.gateway_deployment.aws_api_gateway_deployment.gateway_deployment must be replaced
+/- resource "aws_api_gateway_deployment" "gateway_deployment" {
      ~ created_date      = "2023-01-12T21:12:02Z" -> (known after apply)
      ~ execution_arn     = "arn:aws:execute-api:us-west-2:435552912911:kb7gblbu69/demo" -> (known after apply)
      ~ id                = "dk0err" -> (known after apply)
      ~ invoke_url        = "https://kb7gblbu69.execute-api.us-west-2.amazonaws.com/demo" -> (known after apply)
      ~ stage_description = "Deployed at 2023-01-12T21:12:01Z" -> (known after apply) # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_deployment.deploy will be updated in-place
  ~ resource "aws_apigatewayv2_deployment" "deploy" {
      ~ description   = "Deployed at 2023-01-12T21:12:00Z" -> (known after apply)
        id            = "ey3sgf"
        # (2 unchanged attributes hidden)
    }

  # module.network.aws_apigatewayv2_stage.stage will be updated in-place
  ~ resource "aws_apigatewayv2_stage" "stage" {
        id              = "demo"
        name            = "demo"
        tags            = {}
        # (8 unchanged attributes hidden)

      - access_log_settings {
          - destination_arn = "arn:aws:logs:us-west-2:435552912911:log-group:testing_websocket_api" -> null
          - format          = jsonencode(
                {
                  - caller       = "$context.identity.caller"
                  - connectionId = "$context.connectionId"
                  - eventType    = "$context.eventType"
                  - ip           = "$context.identity.sourceIp"
                  - requestId    = "$context.requestId"
                  - requestTime  = "$context.requestTime"
                  - routeKey     = "$context.routeKey"
                  - status       = "$context.status"
                  - user         = "$context.identity.user"
                }
            ) -> null
        }

        # (1 unchanged block hidden)
    }

Plan: 1 to add, 93 to change, 1 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didnt use the -out option to save this plan, so Terraform cant
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @FreddyJR1995, Action: `pull_request`*